//=============================================================================
//
// ステージ1ボタン [button_stage1.cpp]
// Author : 二階堂汰一
//
//=============================================================================

//*****************************************************************************
// ヘッダファイルのインクルード
//*****************************************************************************
#include "main.h"
#include "manager.h"
#include "renderer.h"
//#include "sound.h"
#include "button_stage1.h"

//*****************************************************************************
// マクロ定義
//*****************************************************************************
#define TEXTURE_PASS ("data/TEXTURE/Button_Stage1.png")		//テクスチャのパス

//*****************************************************************************
// 静的メンバ変数の初期化
//*****************************************************************************
LPDIRECT3DTEXTURE9 CStage1Button::m_pTexture = NULL;	//テクスチャのポインタ

//=============================================================================
// コンストラクタ
//=============================================================================
CStage1Button::CStage1Button()
{
}

//=============================================================================
// デストラクタ
//=============================================================================
CStage1Button::~CStage1Button()
{
}

//=============================================================================
// テクスチャ読み込み関数
//=============================================================================
HRESULT CStage1Button::TextureLoad(void)
{
	//レンダラーの取得
	CRenderer *pRenderer = CManager::GetRenderer();
	//デバイスの取得
	LPDIRECT3DDEVICE9 pDevice = pRenderer->GetDevice();
	//テクスチャの生成
	D3DXCreateTextureFromFile(pDevice,	//デバイスへのポインタ
		TEXTURE_PASS,					//ファイルの名前
		&m_pTexture);					//読み込むメモリー
	return S_OK;
}

//=============================================================================
// テクスチャ破棄関数
//=============================================================================
void CStage1Button::TextureUnload(void)
{
	//もしテクスチャのポインタがNULLではない場合
	if (m_pTexture != NULL)
	{
		//テクスチャの破棄処理関数呼び出し
		m_pTexture->Release();
		//テクスチャをNULLにする
		m_pTexture = NULL;
	}
}

//=============================================================================
// 生成処理関数呼び出し
//=============================================================================
CStage1Button * CStage1Button::Create(D3DXVECTOR3 Position)
{
	//ステージ1ボタンのポインタ
	CStage1Button * pStage1Button = NULL;
	//ステージ1ボタンのポインタがNULLの場合
	if (pStage1Button == NULL)
	{
		//ステージ1ボタンのメモリ確保
		pStage1Button = new CStage1Button;
		//ステージ1ボタンのポインタがNULLではない場合
		if (pStage1Button != NULL)
		{
			//ステージ1ボタンの位置設定
			pStage1Button->SetPos(Position);
			//ステージ1ボタンの初期化処理関数呼び出し
			pStage1Button->Init();
		}
	}
	//ステージ1ボタンのポインタを返す
	return pStage1Button;
}

//=============================================================================
// 初期化処理関数
//=============================================================================
HRESULT CStage1Button::Init(void)
{
	//ボタンの初期化処理関数呼び出し
	CButton::Init();
	//テクスチャの設定
	SetTexUV(0.0f, 1.0f, 0.0f, 1.0f);
	//テクスチャの割り当て
	BindTexture(m_pTexture);
	return S_OK;
}

//=============================================================================
// 終了処理関数
//=============================================================================
void CStage1Button::Uninit(void)
{
	//ボタンの終了処理関数呼び出し
	CButton::Uninit();
}

//=============================================================================
// 更新処理関数
//=============================================================================
void CStage1Button::Update(void)
{
	//ボタンの更新処理関数呼び出し
	CButton::Update();
}

//=============================================================================
// 描画処理関数
//=============================================================================
void CStage1Button::Draw(void)
{
	//ボタンの描画処理関数呼び出し
	CButton::Draw();
}

//=============================================================================
// プレス処理関数
//=============================================================================
void CStage1Button::Press(void)
{
	////サウンドの取得
	//CSound * pSound = CManager::GetSound();
	////もしサウンドのポインタがNULLではない場合
	//if (pSound != NULL)
	//{
	//	//決定音の再生
	//	pSound->PlaySoundA(CSound::SOUND_LABEL_SE_BUTTON_PUSH);
	//}
	//ステージ1モードに遷移する
	CManager::StartFade(CManager::MODE_GAME_STAGE1);
}
